Repository: lyfu19/MSE800-Practice-And-Assignment
Catalog: online_ticket_system/translations/*/LC_MESSAGES/messages.po
Languages: mi

source: NZ Maori Experience
mi: Ngā Wheako Māori o Aotearoa

source: Language changed to
mi: Kua hurihia te reo ki

source: Welcome
mi: Nau mai

source: Home
mi: Kāinga

source: My Bookings
mi: Āku Tono

source: Logout
mi: Takiputa

source: Language
mi: Reo

source: Register
mi: Rēhita

source: Login
mi: Takiuru

source: Logged out successfully
mi: Kua angitū te whakaputa

source: Error
mi: Hapa

source: Please enter a valid email address
mi: Tēnā, tāuruhia he wāhitau īmēra tika

source: Logged in successfully
mi: Kua angitū te takiuru

source: Passwords do not match
mi: Kāore ngā kupuhipa e hāngai ana

source: An error occurred. Please try again.
mi: I puta tētahi hapa. Tēnā, ngana anō.

source: New Zealand Maori Experience
mi: Ngā Wheako Māori o Aotearoa

source: All rights reserved.
mi: Kua rāhuitia ngā mana katoa.

source: Booking Successful
mi: Kua angitū te tono

source: Booking Successful!
mi: Kua angitū te tono!

source: Date
mi: Rā

source: Location
mi: Wāhi

source: Quantity
mi: Rahi

source: Total Price
mi: Utu Katoa

source: Booking ID
mi: Tono ID

source: Thank you for your booking. We look forward to seeing you at the event!
mi: Ngā mihi mō tō tono. E hiahia ana mātou ki te kite i a koe i te hui!

source: Back to Events
mi: Hoki ki ngā Takahanga

source: Event Details
mi: Ngā Taipitopito o te Hui

source: Time
mi: Wā

source: Price
mi: Utu

source: Description
mi: Whakaahuatanga

source: Tickets
mi: Tīkiti

source: Book Now
mi: Tīkina Ināianei

source: Confirm Booking
mi: Whakaū Tono

source: Cancel
mi: Whakakore

source: An error occurred while checking login status
mi: I puta tētahi hapa i te wā e tirohia ana te tūnga takiuru

source: Event
mi: Hui

source: Booking failed
mi: I rahua te tono

source: An error occurred during booking
mi: I puta tētahi hapa i te wā e tono ana

source: Maori Cultural Events
mi: Ngā Takahanga Ahurea Māori

source: View Details
mi: Tirohia ngā Taipitopito

source: Page
mi: Whārangi

source: of
mi: o

source: Previous
mi: O Mua

source: Next
mi: O Muri

source: Booking Details
mi: Ngā Taipitopito Tono

source: Booking ID:
mi: Tono ID:

source: Flight Number:
mi: Tau Rerenga:

source: From:
mi: Mai i:

source: To:
mi: Ki:

source: Date:
mi: Rā:

source: Departure Time:
mi: Te Wā Wehenga:

source: Arrival Time:
mi: Te Wā Taenga:

source: Seat Type:
mi: Momo Tūranga:

source: Price:
mi: Utu:

source: Thank you for choosing our airline. We wish you a pleasant journey!
mi: Ngā mihi mō tō kōwhiringa i tō mātou kamupene rererangi. Kia pai tō haerenga!

source: Book Another Flight
mi: Tīkina tētahi Rerenga Anō

source: Flight Search
mi: Rapu Rerenga

source: Search Flights
mi: Tīkina he Rerenga

source: Search for Flights
mi: Tīkina he Rerenga

source: Select departure
mi: Kōwhiria te wāhi wehe

source: Select arrival
mi: Kōwhiria te wāhi taenga

source: Enter your search criteria and click "Search Flights" to find available flights.
mi: Tāuruhia ō paearu rapu ka pāwhiria "Tīkina he Rerenga" kia kitea ngā rerenga e wātea ana.

source: Departure and arrival airports cannot be the same. Please choose different airports.
mi: Kāore e taea te kōwhiri i te wāhi wehe me te wāhi taenga kotahi. Tēnā, kōwhiria ngā taunga rerekē.

source: No flights found for the selected criteria.
mi: Kāore i kitea he rerenga e hāngai ana ki ngā paearu kua kōwhiria.

source: Search Results
mi: Ngā Hua Rapu

source: Flight
mi: Rerenga

source: at
mi: i

source: Economy:
mi: Ōhanga:

source: seats
mi: nga tūranga

source: Business:
mi: Pakihi:

source: Economy
mi: Ōhanga

source: Business
mi: Pakihi

source: An error occurred while searching for flights. Please try again.
mi: I puta tētahi hapa i te wā e rapu ana i ngā rerenga. Tēnā, ngana anō.

source: An error occurred while checking login status:
mi: I puta tētahi hapa i te wā e tirohia ana te tūnga takiuru:

source: Flight:
mi: Rerenga:

source: Departure:
mi: Wehenga:

source: Arrival:
mi: Taenga:

source: Cabin:
mi: Kāpene:

source: Booking failed:
mi: I rahua te tono:

source: An error occurred. Please try again later.
mi: I puta tētahi hapa. Tēnā, ngana anō ā muri ake nei.

source: Welcome to New Zealand Maori Experience
mi: Nau mai ki ngā Wheako Māori o Aotearoa

source: Discover the rich culture and traditions of the Maori people
mi: Tūhuratia ngā tikanga me ngā ahurea hīhiri o te iwi Māori

source: Book tickets for authentic Maori experiences
mi: Tīkina he tīkiti mō ngā wheako Māori tūturu

source: Flight Tickets
mi: Ngā Tīkiti Rererangi

source: Find the best deals on flights to New Zealand
mi: Kimihia ngā utu pai mō ngā rerenga ki Aotearoa

source: Book Flights
mi: Tīkina he Rerenga

source: Maori Culture
mi: Ahurea Māori

source: The Maori are the indigenous Polynesian people of mainland New Zealand. They have a rich history and culture that dates back over 1000 years. Maori culture is an integral part of New Zealand's identity and offers visitors a unique and enriching experience.
mi: Ko te iwi Māori ngā tāngata whenua o te whenua matua o Aotearoa. He hītori, he ahurea whānui tō rātou e hoki ana ki tua atu i te 1000 tau. Ko te ahurea Māori he wāhanga nui o te tuakiri o Aotearoa, ā, ka tuku i ngā manuhiri he wheako ahurei, he whakangao hoki.

source: Some key aspects of Maori culture include:
mi: Ko ētahi āhuatanga matua o te ahurea Māori ko ngā e whai ake nei:

source: Traditional performances like the haka
mi: Ngā whakaaturanga tuku iho pēnei i te haka

source: Intricate wood carvings and tattoo art (Ta moko)
mi: Ngā whakairo rākau me ngā mahi moko (Ta moko)

source: Marae (meeting grounds) and their protocols
mi: Ngā marae me ā rātou kawa

source: Hangi, a traditional method of cooking food
mi: Hāngī, he tikanga tunu kai tuku iho

source: Learn More
mi: Ako Anō

source: Introduction
mi: Kupu Whakataki

source: Maori Culture: The Heart of New Zealand
mi: Te Ahurea Māori: Te Ngākau o Aotearoa

source: The Maori are the indigenous Polynesian people of New Zealand (Aotearoa), with a rich history spanning over 1000 years. Their culture is an integral part of New Zealand's identity, offering a unique window into Polynesian traditions and values.
mi: Ko te iwi Māori ngā tāngata whenua o te whenua matua o Aotearoa. He hītori, he ahurea whānui tō rātou e hoki ana ki tua atu i te 1000 tau. Ko te ahurea Māori he wāhanga nui o te tuakiri o Aotearoa, ā, ka tuku i ngā manuhiri he wheako ahurei, he whakangao hoki.

source: Maori ancestors were among the first Polynesian voyagers to settle in New Zealand, arriving in several waves of canoe voyages between 1250 and 1300 CE. Over centuries, they developed a distinct culture adapted to the New Zealand environment.
mi: Ko ngā tīpuna Māori te hunga tuatahi o ngā waka Polynesia i tau mai ki Aotearoa, i tae mai rātou i roto i ngā hekenga waka maha i waenganui i te tau 1250 me te 1300 CE. Neke atu i ngā rau tau, ka whanake rātou i tētahi ahurea motuhake e urutau ana ki te taiao o Aotearoa.

source: The Maori creation story tells of Ranginui (the sky father) and Papatuanuku (the earth mother), whose children separated them to create the world of light. This rich mythology forms the basis of Maori spiritual beliefs and their connection to the land.
mi: Ko te pūrākau o te orokohanga Māori e pā ana ki a Ranginui (te matua o te rangi) me Papatuanuku (te whaea o te whenua), nā ā rāua tamariki i wehe i a rāua kia waihanga i te ao mārama. Ko tēnei pūrākau whai rawa te tūāpapa o ngā whakapono wairua Māori me tā rātou hononga ki te whenua.

source: Te Reo Maori is the language of the Maori people. It's one of New Zealand's official languages and is experiencing a revival in usage and learning. The language is known for its beautiful, poetic qualities and its importance in preserving Maori culture.
mi: Ko Te Reo Māori te reo o te iwi Māori. Koinei tētahi o ngā reo whaimana o Aotearoa, ā, kei te tipu anō tōna whakamahinga me te ako. E mōhiotia ana te reo mō tōna ātaahua, tōna ahurei i te whaihanga, me tōna hiranga i te tiaki i te ahurea Māori.

source: Example phrase
mi: Tauira rerenga kōrero

source: A greeting that means "Hello" or "Be well"
mi: He mihi e kī ana "Tēnā koe" rānei "Kia pai tō ora"

source: Traditional Arts
mi: Ngā Toi Tawhito

source: Carving (Whakairo)
mi: Te Whakairo

source: Intricate wood carvings that tell stories of ancestry and mythology. These carvings can be found on meeting houses, canoes, and various tools and ornaments.
mi: Ko ngā whakairo rākau mātatoru e kōrero ana i ngā pūrākau o ngā tīpuna me ngā kōrero tuku iho. Ka kitea ēnei whakairo i runga i ngā whare hui, ngā waka, me ngā taputapu, taonga anō hoki.

source: Weaving (Raranga)
mi: Te Raranga

source: The art of weaving flax into baskets, mats, and clothing. This craft is not only practical but also holds deep cultural significance.
mi: Ko te toi o te raranga i te harakeke hei hanga i ngā kete, whāriki, me ngā kākahu. Ehara tēnei mahi toi i te mea whaihua anake, engari he tino nui hoki tōna tikanga ahurea.

source: Ta Moko
mi: Te Tā Moko

source: Traditional Maori tattooing, with designs that are unique to the individual. These tattoos often represent a person's genealogy, social status, and personal achievements.
mi: Ko te tā moko tawhito o te Māori, he toi e mōhiotia ana mō ngā hoahoa motuhake o te tangata. Ko ēnei moko ka tohu i te whakapapa, te tūnga pāpori, me ngā whakatutukitanga whaiaro.

source: Customs and Traditions
mi: Ngā Tikanga me Ngā Taonga Tuku Iho

source: Powhiri
mi: Pōwhiri

source: A traditional Maori welcome ceremony that follows a specific protocol. It includes speeches, singing, and the famous hongi (pressing of noses) as a greeting.
mi: Ko te pōwhiri tētahi tikanga tuku iho o te Māori hei pōwhiri i ngā manuhiri, ā, ka whai i tētahi kawa motuhake. Ka whai wāhi ki ngā whaikōrero, waiata, me te hongi (te pōhiri mā te pao ihu).

source: A traditional war dance, now performed at various cultural events and sports matches. The haka is a powerful display of a group's pride, strength and unity.
mi: Ko te haka tētahi kanikani pakanga tuku iho, i nāianei ka mahia i ngā hui ahurea, me ngā whakataetae hākinakina. He whakaaturanga kaha tēnei e whakaatu ana i te whakahī, te kaha, me te kotahitanga o te rōpū.

source: Hangi
mi: Hāngi

source: A traditional method of cooking food using heated rocks buried in a pit oven. This communal cooking method is often used for special occasions and gatherings.
mi: Ko te hāngi tētahi tikanga tawhito mō te tunu kai mā ngā kōhatu wera kua tanumia ki roto i te umu rua. Ka whakamahia tēnei tikanga tunu kai mō ngā hui motuhake me ngā nohonga ā-iwi.

source: The marae is the focal point of Maori communities. It's a complex of buildings where people gather for meetings, celebrations, funerals, and other important events. The main building on a marae is the wharenui (meeting house), which is considered the embodiment of an ancestor.
mi: Ko te marae te pokapū o ngā hapori Māori. He kāhui whare e huihui ai ngā tāngata mō ngā hui, ngā whakanuitanga, ngā tangihanga, me ētahi atu kaupapa nui. Ko te wharenui te whare matua o te marae, e whakaarotia ana ko te tūāpapa o tētahi tūpuna.

source: Mythology
mi: Ngā Kōrero Tuku Iho

source: Maori mythology is rich with stories of gods, demigods, and legendary heroes. These stories explain the creation of the world and natural phenomena. Some key figures include:
mi: Kei roto i ngā kōrero tuku iho a te Māori ngā kōrero mō ngā atua, ngā atua hautipua, me ngā toa rongonui. Ko ēnei kōrero ka whakamārama i te orokohanga o te ao, me ngā āhuatanga taiao. Ko ētahi tino tangata rongonui ko ēnei:

source: Maui
mi: Māui

source: A clever demigod known for fishing up the North Island of New Zealand and slowing the sun.
mi: Ko Māui tētahi atua hautipua mō tōna mātau i te hī ake i Te Ika-a-Māui (Te Ika o Te Raki), me te whakawhāiti i te ra.

source: Tane Mahuta
mi: Tāne Mahuta

source: The god of forests and birds, who separated the sky and earth.
mi: Ko Tāne Mahuta te atua o ngā ngahere me ngā manu, nāna i wehe te rangi me te whenua.

source: The god of the sea.
mi: Ko Tangaroa te atua o te moana.

source: Contemporary Maori Culture
mi: Te Ahurea Māori o Nāianei

source: Today, Maori culture continues to thrive and evolve. It plays a significant role in New Zealand's national identity, influencing art, literature, sports, and politics. Many Maori are working to preserve their language and traditions while also embracing modern opportunities.
mi: I ēnei rā, kei te puāwai, kei te whanake tonu te ahurea Māori. He wāhi nui tōna ki te tuakiri ā-motu o Aotearoa, ā, e whakaawe ana i ngā toi, ngā tuhinga, ngā hākinakina, me ngā tōrangapū. He maha ngā Māori e mahi ana ki te tiaki i tō rātou reo me ō rātou tikanga, i te wā e whāngai ana i ngā whai wāhitanga o te ao hōu.

source: Maori culture is celebrated in various festivals throughout New Zealand, such as Matariki (Maori New Year) and Te Matatini (national kapa haka competition).
mi: Ka whakanuia te ahurea Māori i roto i ngā ahurei maha puta noa i Aotearoa, pēnei i a Matariki (Te Tau Hou Māori) me Te Matatini (te whakataetae kapa haka ā-motu).

source: Select Language
mi: Kōwhiria te Reo

source: English
mi: Ingarihi

source: Log in
mi: Takiuru

source: Email
mi: Īmēra

source: Password
mi: Kupuhipa

source: Continue
mi: Haere Tonu

source: Forgot password?
mi: Kua wareware i a koe te kupuhipa?

source: Sign up
mi: Rēhita

source: Confirm password
mi: Whakaū Kupuhipa

source: Already have an account?
mi: Kua rēhita kē koe?

source: All Bookings
mi: Ngā Tono Katoa

source: Flights
mi: Ngā Rerenga

source: Events
mi: Ngā Hui

source: No bookings found.
mi: Kāore i kitea he tono.

source: Event Booking
mi: Tono Hui

source: Booking Date
mi: Rā Tono

source: No event bookings found.
mi: Kāore i kitea he tono hui.

source: Flight Booking
mi: Tono Rerenga

source: Flight Number
mi: Tau Rerenga

source: Airline
mi: Rererangi

source: From
mi: Mai i

source: To
mi: Ki

source: Departure
mi: Wehenga

source: Arrival
mi: Taenga

source: Seat Type
mi: Momo Tūranga

source: Status
mi: Tūnga

source: No flight bookings found.
mi: Kāore i kitea he tono rerenga.
